In [32]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [33]:
import pandas as pd

In [34]:
df = pd.DataFrame(people)

In [35]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [82]:
df.sort_values(by='last', ascending=False)

                     email      full_name  first     last
3       IronMan@avenge.com            NaN   Tony    Stark
2        johndoe@email.com     John Smith   John    Smith
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
4           Cap@avenge.com            NaN  Steve   Rogers
1        janedoe@email.com       Mary Doe   Mary      Doe

In [83]:
df.sort_values(by=['last', 'first'], ascending=False)

                     email      full_name  first     last
3       IronMan@avenge.com            NaN   Tony    Stark
2        johndoe@email.com     John Smith   John    Smith
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
4           Cap@avenge.com            NaN  Steve   Rogers
1        janedoe@email.com       Mary Doe   Mary      Doe

In [84]:
df.sort_values(by=['last', 'first'], ascending=[False, True], inplace=True)

In [85]:
df

                     email      full_name  first     last
3       IronMan@avenge.com            NaN   Tony    Stark
2        johndoe@email.com     John Smith   John    Smith
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
4           Cap@avenge.com            NaN  Steve   Rogers
1        janedoe@email.com       Mary Doe   Mary      Doe

In [86]:
df.sort_index()

                     email      full_name  first     last
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
1        janedoe@email.com       Mary Doe   Mary      Doe
2        johndoe@email.com     John Smith   John    Smith
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [87]:
df['last'].sort_values()

1        Doe
4     Rogers
0    Schafer
2      Smith
3      Stark
Name: last, dtype: object